nc: 1

scales:
  l: [1.00, 1.00, 1024]

backbone:
  - [-1, 1, ConvNormLayer, [32, 3, 2, 1, 'relu']]
  - [-1, 1, HG-WTConv, [32, 3, 1]]
  - [-1, 1, HG-WTConv, [64, 3, 1]]
  - [-1, 1, nn.MaxPool2d, [3, 2, 1]]
  - [-1, 2, HG-ResLayer, [64, 1, False, 1]]
  - [-1, 3, HG-ResLayer, [128, 2, False, 1]]
  - [-1, 2, SFM-ResLayer, [256, 2, False, 1]]
  - [-1, 2, SFM-ResLayer, [512, 2, False, 1]]

head:
  - [7, 1, UpSample, [512]]
  - [6, 1, Conv, [256, 1, 1]]
  - [5, 1, SPDConv, [256, 3, 1]]
  - [4, 1, SPDConv, [128, 3, 1]]
  - [-1, 1, SPDConv, [256, 3, 1]]

  - [[8, 9, 10, 12], 1, Concat, [1]]
  - [-1, 1, Conv, [256, 1, 1]]
  - [-1, 1, ODAM, [1024]]

  - [15, 1, SPDConv, [256, 3, 1]]
  - [7, 1, Conv, [256, 1, 1]]
  - [[-1, 16], 1, Concat, [1]]
  - [-1, 3, MRFEM, [256, 0.5]]

  - [[9, 15], 1, Concat, [1]]
  - [-1, 3, MRFEM, [256, 0.5]]

  - [15, 1, UpSample, [256]]
  - [5, 1, Conv, [256, 1, 1]]
  - [[-1, 22], 1, Concat, [1]]
  - [-1, 3, MRFEM, [256, 0.5]]

  - [22, 1, UpSample, [256]]
  - [4, 1, Conv, [256, 1, 1]]
  - [[-1, 26], 1, Concat, [1]]
  - [-1, 3, MRFEM, [256, 0.5]]

  - [[29, 25, 21, 19], 1, RTDETRDecoder, [nc, 256, 300, 4, 8, 4]]